In [27]:
import pandas as pd

In [29]:
df = pd.read_csv("employees.csv")

In [35]:
filter_deptno = 10

In [44]:
filtered_df = df[df['deptno'] == filter_deptno]

In [50]:
filtered_df['ename'].str.upper().copy()

0      JOHN DOE
2     SAM BROWN
5    SUSAN BLUE
Name: ename, dtype: object

In [51]:
filtered_df

   empno       ename  deptno  salary  commission
0   1001    JOHN DOE      10   50000         NaN
2   1003   SAM BROWN      10   55000      2500.0
5   1006  SUSAN BLUE      10   52000      2200.0

In [55]:
filtered_df['salary']+filtered_df['commission'].fillna(0)

0    50000.0
2    57500.0
5    54200.0
dtype: float64

In [56]:
df1 = pd.read_csv("tgt_employees.csv")

In [57]:
df1

   empno       ename  deptno  salary  commission  total_compensation
0   1001    JOHN DOE      10   50000         NaN             50000.0
1   1003   SAM BROWN      10   55000      2500.0             57500.0
2   1006  SUSAN BLUE      10   52000      2200.0             54200.0

In [60]:
df1.isnull().sum().sum()

1